context = {
    "PROJECT_NAME": {
        "name": "GeoCoreClassifier",
        "description": "Название проекта."
    },
    "ROCK_SAMPLE": {
        "name": "Описание керна",
        "description": ""
    },
    "INDEX_HTML": {
        "name": "GeoCoreClassifier — это передовое решение для геологов и специалистов в области исследования данных. Платформа предоставляет мощные инструменты для классификации и анализа геологических данных, обеспечивая точность и эффективность в ваших исследованиях.",
        "description": "Возможности платформы включают в себя сбор данных, интеграцию документации, визуализацию, аналитику и многое другое. GeoCoreClassifier помогает преобразовать сложные геологические данные в понятные и легко управляемые результаты, делая вашу работу проще и продуктивнее."
    }
}


# Глобальные константы
def global_constants(request):
    return context
